; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 31162 1 3 4 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared3 - mode
	spectrograph1 - mode
	infrared2 - mode
	image0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation3 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(have_image Star7 infrared3)
	(have_image Planet8 infrared2)
	(have_image Phenomenon9 infrared3)
	(have_image Phenomenon10 image0)
	(have_image Star11 infrared2)
	(have_image Phenomenon12 infrared2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 star7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star7)
   goals met: 0 of 7
3. (turn_to satellite0 groundstation3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 7
4. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 7
5. (turn_to satellite0 star7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star7)
   goals met: 0 of 7
6. (take_image satellite0 star7 instrument0 infrared3)
   added: (have_image star7 infrared3)
   goals met: 1 of 7
7. (turn_to satellite0 star11 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star11)
   goals met: 1 of 7
8. (take_image satellite0 star11 instrument0 infrared2)
   added: (have_image star11 infrared2)
   goals met: 2 of 7
9. (turn_to satellite0 planet8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet8)
   goals met: 2 of 7
10. (take_image satellite0 planet8 instrument0 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 3 of 7
11. (turn_to satellite0 phenomenon9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 7
12. (take_image satellite0 phenomenon9 instrument0 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 5 of 7
13. (turn_to satellite0 phenomenon12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 7
14. (take_image satellite0 phenomenon12 instrument0 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 5 of 7
15. (turn_to satellite0 phenomenon9 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 7
16. (turn_to satellite0 phenomenon10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 7
17. (take_image satellite0 phenomenon10 instrument0 image0)
   added: (have_image phenomenon10 image0)
   goals met: 6 of 7
18. (turn_to satellite0 phenomenon9 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon9)
   goals met: 7 of 7
